In [1]:
import numpy as np

In [2]:
import pandas as pd

/var/folders/91/z24ntl2d16d_gxk0ddj090mm0000gn/T/ipykernel_18612/4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
dfc=pd.read_csv('company.csv')

In [4]:
dfp=pd.read_csv('party.csv')

In [5]:
dfc.head()

  Date of Purchase       Purchaser Name  Denomination  Unnamed: 3
0      12/Apr/2019  A B C INDIA LIMITED        100000         NaN
1      12/Apr/2019  A B C INDIA LIMITED        100000         NaN
2      12/Apr/2019  A B C INDIA LIMITED       1000000         NaN
3      12/Apr/2019  A B C INDIA LIMITED       1000000         NaN
4      12/Apr/2019  A B C INDIA LIMITED        100000         NaN

In [6]:
dfp.head()

,Date of\nEncashment,Name of the Political Party,Denomination,Unnamed: 3
0,12/Apr/2019,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,NaN
1,12/Apr/2019,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,NaN
2,12/Apr/2019,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,10000000,NaN
3,12/Apr/2019,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,NaN
4,12/Apr/2019,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,NaN

In [7]:
company_info = dfc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18871 entries, 0 to 18870
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Date of Purchase  18871 non-null  object
 1   Purchaser Name    18871 non-null  object
 2   Denomination      18871 non-null  int64
 3   Unnamed: 3        0 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 589.8+ KB

In [8]:
party_info = dfp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20421 entries, 0 to 20420
Data columns (total 4 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Date of
Encashment           20421 non-null  object
 1   Name of the Political Party  20421 non-null  object
 2   Denomination                 20421 non-null  int64
 3   Unnamed: 3                   0 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 638.3+ KB

In [9]:
dfc.columns = ['Date_of_Purchase', 'Purchaser_Name', 'Denomination', 'Unnamed']
dfc

      Date_of_Purchase                  Purchaser_Name  Denomination  Unnamed
0          12/Apr/2019             A B C INDIA LIMITED        100000      NaN
1          12/Apr/2019             A B C INDIA LIMITED        100000      NaN
2          12/Apr/2019             A B C INDIA LIMITED       1000000      NaN
3          12/Apr/2019             A B C INDIA LIMITED       1000000      NaN
4          12/Apr/2019             A B C INDIA LIMITED        100000      NaN
...                ...                             ...           ...      ...
18866      11/Jan/2024  WESTWELL GASES PRIVATE LIMITED      10000000      NaN
18867      11/Jan/2024  WESTWELL GASES PRIVATE LIMITED      10000000      NaN
18868      11/Jan/2024  WESTWELL GASES PRIVATE LIMITED      10000000      NaN
18869      11/Jan/2024  WESTWELL GASES PRIVATE LIMITED      10000000      NaN
18870      11/Jan/2024  WESTWELL GASES PRIVATE LIMITED      10000000      NaN

[18871 rows x 4 columns]

In [10]:
dfc.drop(columns=['Unnamed'], inplace=True)

In [11]:
dfc.head()

  Date_of_Purchase       Purchaser_Name  Denomination
0      12/Apr/2019  A B C INDIA LIMITED        100000
1      12/Apr/2019  A B C INDIA LIMITED        100000
2      12/Apr/2019  A B C INDIA LIMITED       1000000
3      12/Apr/2019  A B C INDIA LIMITED       1000000
4      12/Apr/2019  A B C INDIA LIMITED        100000

In [12]:
dfp.columns = ['Date_of_Encashment', 'Party', 'Denomination', 'Unnamed']

In [13]:
dfp.drop(columns=['Unnamed'], inplace=True)

In [14]:
dfp.head()

  Date_of_Encashment                                     Party  Denomination
0        12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM       1000000
1        12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM       1000000
2        12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM      10000000
3        12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM       1000000
4        12/Apr/2019  ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM       1000000

In [15]:
import datetime

In [16]:
# Convert 'Date of Purchase' column in both datasets to datetime
dfc['Date_of_Purchase'] = pd.to_datetime(dfc['Date_of_Purchase'])
dfp['Date_of_Encashment'] = pd.to_datetime(dfp['Date_of_Encashment'])

In [17]:
df_merged = dfp.merge(dfc, how='inner')

In [18]:
df_merged['days_difference'] = (df_merged['Date_of_Encashment'] - df_merged['Date_of_Purchase']).dt.days

In [19]:
filtered_df = df_merged[(df_merged['days_difference'] >= 0)&(df_merged['days_difference'] <=15)]

In [20]:
filtered_df

,Date_of_Encashment,Party,Denomination,Date_of_Purchase,Purchaser_Name,days_difference
0,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,2019-04-12,A B C INDIA LIMITED,0
1,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,2019-04-12,A B C INDIA LIMITED,0
2,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,2019-04-12,A B C INDIA LIMITED,0
3,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,2019-04-12,ACROPOLIS MAINTENANCE SERVICES PRIVATE LIMITED,0
4,2019-04-12,ALL INDIA ANNA DRAVIDA MUNNETRA KAZHAGAM,1000000,2019-04-12,ACROPOLIS MAINTENANCE SERVICES PRIVATE LIMITED,0
...,...,...,...,...,...,...
172948516,2024-01-24,JANASENA PARTY,1000000,2024-01-11,VIDUR GUPTA,13
172948517,2024-01-24,JANASENA PARTY,1000000,2024-01-11,VIDUR GUPTA,13
172948518,2024-01-24,JANASENA PARTY,1000000,2024-01-11,VIDUR GUPTA,13
172948519,2024-01-24,JANASENA PARTY,1000000,2024-01-11,VIDUR GUPTA,13
172948520,2024-01-24,JANASENA PARTY,1000000,2024-01-11,VIDUR GUPTA,13

In [21]:
filtered_df.to_csv('merged_data.csv', index=False)

In [24]:
customer_data = pd.DataFrame(dfc)

In [25]:
customer_data['Date_of_Purchase'] = pd.to_datetime(customer_data['Date_of_Purchase'])

In [37]:
customer_data['month_year'] = customer_data['Date_of_Purchase'].dt.to_period('M')

In [38]:
monthly_total_denomination = customer_data.groupby(['month_year', 'Purchaser_Name'])['Denomination'].sum().reset_index()

In [39]:
monthly_total_denomination

     month_year                                  Purchaser_Name  Denomination
0       2019-04                             A B C INDIA LIMITED       4000000
1       2019-04           ACE COMERCIAL COMPANY PRIVATE LIMITED       2500000
2       2019-04  ACROPOLIS MAINTENANCE SERVICES PRIVATE LIMITED       2500000
3       2019-04                         ADIT BUILD WELL PVT LTD      10000000
4       2019-04         AISHWARYA BUSINESS CORPORATION PVT, LTD      50000000
...         ...                                             ...           ...
1848    2024-01                                     VIDUR GUPTA       5000000
1849    2024-01            VIHAAN AUTO VENTURES PRIVATE LIMITED      20000000
1850    2024-01                             VIKAS PARASRAMPURIA      20000000
1851    2024-01  WESTERN UP POWER TRANSMISSION COMPANY LI MITED     300000000
1852    2024-01                  WESTWELL GASES PRIVATE LIMITED      80000000

[1853 rows x 3 columns]

In [40]:
monthly_total_denomination.sort_values(by=['month_year', 'Purchaser_Name'], inplace=True)

In [41]:
monthly_total_denomination

     month_year                                  Purchaser_Name  Denomination
0       2019-04                             A B C INDIA LIMITED       4000000
1       2019-04           ACE COMERCIAL COMPANY PRIVATE LIMITED       2500000
2       2019-04  ACROPOLIS MAINTENANCE SERVICES PRIVATE LIMITED       2500000
3       2019-04                         ADIT BUILD WELL PVT LTD      10000000
4       2019-04         AISHWARYA BUSINESS CORPORATION PVT, LTD      50000000
...         ...                                             ...           ...
1848    2024-01                                     VIDUR GUPTA       5000000
1849    2024-01            VIHAAN AUTO VENTURES PRIVATE LIMITED      20000000
1850    2024-01                             VIKAS PARASRAMPURIA      20000000
1851    2024-01  WESTERN UP POWER TRANSMISSION COMPANY LI MITED     300000000
1852    2024-01                  WESTWELL GASES PRIVATE LIMITED      80000000

[1853 rows x 3 columns]